; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
;; base case
;; graph:
;; l1 - l2
;;  | X |
;; l3 - l4

(define (problem transport-08)
 (:domain transport)
 (:objects
    v1 v2 - vehicle
    p1 - package
    l1 l2 l3 l4 - location
    c0 c1 c2 - size
    )
 (:init
    (capacity v1 c2)
    (capacity v2 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l2)
    (at v1 l4)
    (at v2 l1)
    (road l1 l2)
    (road l2 l1)
    (road l1 l3)
    (road l3 l1)
    (road l1 l4)
    (road l4 l1)
    (road l3 l2)
    (road l2 l3)
    (road l4 l2)
    (road l2 l4)
    (road l4 l3)
    (road l3 l4)
    )
 (:goal  (and
    (at p1 l3)
 )))

; plan
1. (drive v1 l4 l2)
   deleted: (at v1 l4)
   added: (at v1 l2)
   goals met: 0 of 1
2. (pick-up v1 l2 p1 c1 c2)
   deleted: (at p1 l2) (capacity v1 c2)
   added: (in p1 v1) (capacity v1 c1)
   goals met: 0 of 1
3. (drive v1 l2 l3)
   deleted: (at v1 l2)
   added: (at v1 l3)
   goals met: 0 of 1
4. (drop v1 l3 p1 c1 c2)
   deleted: (in p1 v1) (capacity v1 c1)
   added: (at p1 l3) (capacity v1 c2)
   goals met: 1 of 1
